use Kor_MyBase;
SELECT 
  t.Название_кредита AS Тип_кредита,
  MAX(k.Сумма) AS Максимальная_сумма,
  MIN(k.Сумма) AS Минимальная_сумма,
  AVG(k.Сумма) AS Средняя_сумма,
  SUM(k.Сумма) AS Суммарная_сумма,
  COUNT(*) AS Количество_кредитов
FROM 
  Кредиты k
  INNER JOIN [Типы кредитов] t ON k.ID_Типа_кредита = t.ID_Типа_кредита
GROUP BY 
  t.Название_кредита



SELECT
  t.Диапазон_суммы AS Диапазон_суммы,
  COUNT(*) AS Количество_кредитов,
  SUM(t.Сумма) AS Сумма_кредитов
FROM
  (
    SELECT
      Кредиты.ID_Кредита AS ID_Кредита,
      Кредиты.Сумма AS Сумма,
      CASE
        WHEN Кредиты.Сумма BETWEEN 0 AND 25000 THEN '0-25000'
        WHEN Кредиты.Сумма BETWEEN 25001 AND 50000 THEN '25001-50000'
        WHEN Кредиты.Сумма BETWEEN 50001 AND 75000 THEN '50001-75000'
        WHEN Кредиты.Сумма BETWEEN 75001 AND 100000 THEN '75001-100000'
        ELSE '100001-150000'
      END AS Диапазон_суммы
    FROM
      Кредиты
  ) t
GROUP BY
  t.Диапазон_суммы
ORDER BY
  Сумма_кредитов DESC;



SELECT [Типы кредитов].ID_Типа_кредита, 
       Название_кредита, 
       CAST(ROUND(AVG(Кредиты.Сумма), 2) AS NUMERIC(10,2)) AS Средняя_оценка
FROM Кредиты
INNER JOIN [Типы кредитов] ON Кредиты.ID_Типа_кредита = [Типы кредитов].ID_Типа_кредита
GROUP BY [Типы кредитов].ID_Типа_кредита, Название_кредита
ORDER BY Средняя_оценка DESC;



SELECT [Типы кредитов].Название_кредита, ROUND(AVG(CAST(Кредиты.Сумма AS FLOAT)), 2) AS Средняя_оценка
FROM Кредиты
INNER JOIN [Типы кредитов] ON Кредиты.ID_Типа_кредита = [Типы кредитов].ID_Типа_кредита
WHERE Кредиты.Дата_выдачи BETWEEN '2022-03-01' AND '2022-12-31'
GROUP BY [Типы кредитов].Название_кредита
ORDER BY Средняя_оценка DESC;



SELECT Кредиты.ID_Типа_кредита, [Типы кредитов].Название_кредита, AVG(Кредиты.Сумма) AS Средняя_сумма_кредита
FROM Кредиты
INNER JOIN [Типы кредитов] ON Кредиты.ID_Типа_кредита = [Типы кредитов].ID_Типа_кредита
GROUP BY Кредиты.ID_Типа_кредита, [Типы кредитов].Название_кредита
HAVING AVG(Кредиты.Сумма) > 50000
ORDER BY Средняя_сумма_кредита DESC;

